MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/cmp/processor/cmp_p32mx695f512h.h
/* Created by plibgen $Revision: 1.30 $ */

#ifndef _CMP_P32MX695F512H_H
#define _CMP_P32MX695F512H_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    CMP_ID_1 = 0,
    CMP_ID_2 = 1,
    CMP_NUMBER_OF_MODULES

} CMP_MODULE_ID;

typedef enum {

    CMP_CVREF_VOLTAGE_SOURCE_NEG_REFERENCE_NONE = 0x00

} CMP_CVREF_VOLTAGE_SOURCE_NEG_REFERENCE;

typedef enum {

    CMP_MASK_C_PWM1H = 0x02,
    CMP_MASK_C_PWM2L = 0x03,
    CMP_MASK_C_PWM2H = 0x04,
    CMP_MASK_C_PWM3L = 0x05,
    CMP_MASK_C_PWM3H = 0x06,
    CMP_MASK_C_PTGO18 = 0x07,
    CMP_MASK_C_PTGO19 = 0x05,
    CMP_MASK_C_FLT2 = 0x06,
    CMP_MASK_C_FLT4 = 0x07

} CMP_MASK_C;

typedef enum {

    CMP_MASK_B_PWM1H = 0x02,
    CMP_MASK_B_PWM2L = 0x03,
    CMP_MASK_B_PWM2H = 0x04,
    CMP_MASK_B_PWM3L = 0x05,
    CMP_MASK_B_PWM3H = 0x06,
    CMP_MASK_B_PTGO18 = 0x07,
    CMP_MASK_B_PTGO19 = 0x05,
    CMP_MASK_B_FLT2 = 0x06,
    CMP_MASK_B_FLT4 = 0x07

} CMP_MASK_B;

typedef enum {

    CMP_MASK_A_PWM1H = 0x02,
    CMP_MASK_A_PWM2L = 0x03,
    CMP_MASK_A_PWM2H = 0x04,
    CMP_MASK_A_PWM3L = 0x05,
    CMP_MASK_A_PWM3H = 0x06,
    CMP_MASK_A_PTGO18 = 0x07,
    CMP_MASK_A_PTGO19 = 0x05,
    CMP_MASK_A_FLT2 = 0x06,
    CMP_MASK_A_FLT4 = 0x07

} CMP_MASK_A;

typedef enum {

    CMP_SPEED_POWER_LOWER = 0x01,
    CMP_SPEED_POWER_HIGHER = 0x02

} CMP_SPEED_POWER;

typedef enum {

    CMP_FILTER_CLOCK_FP = 0x01,
    CMP_FILTER_CLOCK_FOSC = 0x02,
    CMP_FILTER_CLOCK_SYNCO1 = 0x03,
    CMP_FILTER_CLOCK_T2CLK = 0x04,
    CMP_FILTER_CLOCK_T3CLK = 0x05,
    CMP_FILTER_CLOCK_T4CLK = 0x06,
    CMP_FILTER_CLOCK_T5CLK = 0x07

} CMP_FILTER_CLOCK;

typedef enum {

    CMP_FILTER_CLOCK_DIVIDE_1_1 = 0x01,
    CMP_FILTER_CLOCK_DIVIDE_1_2 = 0x02,
    CMP_FILTER_CLOCK_DIVIDE_1_4 = 0x04,
    CMP_FILTER_CLOCK_DIVIDE_1_8 = 0x08,
    CMP_FILTER_CLOCK_DIVIDE_1_16 = 0x10,
    CMP_FILTER_CLOCK_DIVIDE_1_32 = 0x20,
    CMP_FILTER_CLOCK_DIVIDE_1_64 = 0x40,
    CMP_FILTER_CLOCK_DIVIDE_1_128 = 0x80

} CMP_CLOCK_DIVIDE;

typedef enum {

    CMP_CVREF_VALUE_0 = 0x00,
    CMP_CVREF_VALUE_1 = 0x01,
    CMP_CVREF_VALUE_2 = 0x02,
    CMP_CVREF_VALUE_3 = 0x03,
    CMP_CVREF_VALUE_4 = 0x04,
    CMP_CVREF_VALUE_5 = 0x05,
    CMP_CVREF_VALUE_6 = 0x06,
    CMP_CVREF_VALUE_7 = 0x07,
    CMP_CVREF_VALUE_8 = 0x08,
    CMP_CVREF_VALUE_9 = 0x09,
    CMP_CVREF_VALUE_10 = 0x0A,
    CMP_CVREF_VALUE_11 = 0x0B,
    CMP_CVREF_VALUE_12 = 0x0C,
    CMP_CVREF_VALUE_13 = 0x0D,
    CMP_CVREF_VALUE_14 = 0x0E,
    CMP_CVREF_VALUE_15 = 0x0F

} CMP_CVREF_VALUE;

typedef enum {

    CMP_CVREF_VOLTAGE_SOURCE_VDD = 0x00,
    CMP_CVREF_VOLTAGE_SOURCE_EXTERNAL = 0x01

} CMP_CVREF_VOLTAGE_SOURCE;

typedef enum {

    CMP_INTERRUPT_GENERATION_DISABLED = 0x00,
    CMP_INTERRUPT_GENERATION_LOW_TO_HIGH = 0x01,
    CMP_INTERRUPT_GENERATION_HIGH_TO_LOW = 0x02,
    CMP_INTERRUPT_GENERATION_BOTH = 0x03

} CMP_INTERRUPT_EVENT;

typedef enum {

    CMP_INVERTING_INPUT_EXTERNAL_NEGATIVE_PIN = 0x00,
	CMP_INVERTING_INPUT_EXTERNAL_POSITIVE_PIN = 0x01,
	CMP_INVERTING_INPUT_OTHER_MODULE_EXTERNAL_POSITIVE_PIN = 0x02,
	CMP_INVERTING_INPUT_IVREF = 0x03,
	
    CMP_INPUT_C2IN_NEGATIVE = 0x00,
    CMP_INPUT_C2IN_POSITIVE = 0x01,
    CMP_INPUT_C1IN_POSITIVE = 0x02,
    CMP_INPUT_IVREF = 0x03

} CMP_INVERTING_INPUT;

typedef enum {

	CMP_NON_INVERTING_INPUT_EXTERNAL_POSITIVE_PIN = 0x00,
	CMP_NON_INVERTING_INPUT_CVREF = 0x01,
	
    CMP_INPUT_EXTERNAL_PIN = 0x00,
    CMP_INPUT_INTERNAL_CVREF = 0x01

} CMP_NON_INVERTING_INPUT;

typedef enum {

    CMP_CVREF_RESISTOR_LADDER_VOLTAGE = 0x00,
    CMP_CVREF_POSITIVE_REFERENCE_VOLTAGE = 0x01

} CMP_CVREF_REFERENCE_SELECT;

typedef enum {

    CMP_CVREF_BANDGAP_1_2V = 0x00,
    CMP_CVREF_BANDGAP_0_6V = 0x01,
    CMP_CVREF_BANDGAP_VREFPLUS = 0x02

} CMP_CVREF_BANDGAP_SELECT;

PLIB_INLINE SFR_TYPE* _CMP_CMP_ENABLE_CONTROL_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CM1CON;
        case CMP_ID_2 :
            return &CM2CON;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_CMP_OUTPUT_ENABLE_CONTROL_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CM1CON;
        case CMP_ID_2 :
            return &CM2CON;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_CMP_INVERT_OUTPUT_CONTROL_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CM1CON;
        case CMP_ID_2 :
            return &CM2CON;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_CMP_OUTPUT_LEVEL_CONTROL_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CM1CON;
        case CMP_ID_2 :
            return &CM2CON;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_CMP_INTERRUPT_EVENT_SELECT_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CM1CON;
        case CMP_ID_2 :
            return &CM2CON;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_NON_INVERTING_INPUT_SELECTION_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CM1CON;
        case CMP_ID_2 :
            return &CM2CON;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_INVERTING_INPUT_SELECTION_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CM1CON;
        case CMP_ID_2 :
            return &CM2CON;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

