MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/cmp/processor/cmp_p32mx695f512h.h
PLIB_INLINE SFR_TYPE* _CMP_CMP_OUTPUT_STATUS_GET1_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CMSTAT;
        case CMP_ID_2 :
            return &CMSTAT;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_CMP_OUTPUT_STATUS_GET2_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CMSTAT;
        case CMP_ID_2 :
            return &CMSTAT;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_STOP_IN_IDLE_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CMSTAT;
        case CMP_ID_2 :
            return &CMSTAT;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_CMP_CVREF_ENABLE_CONTROL_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CVRCON;
        case CMP_ID_2 :
            return &CVRCON;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_CMP_CVREF_OUTPUT_ENABLE_CONTROL_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CVRCON;
        case CMP_ID_2 :
            return &CVRCON;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_CMP_CVREF_WIDE_RANGE_CONTROL_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CVRCON;
        case CMP_ID_2 :
            return &CVRCON;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_CMP_CVREF_VOLTAGE_RANGE_SELECT_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CVRCON;
        case CMP_ID_2 :
            return &CVRCON;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _CMP_CMP_CVREF_VALUE_SELECT_VREG(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return &CVRCON;
        case CMP_ID_2 :
            return &CVRCON;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_ENABLE_CONTROL_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_ON_MASK;
        case CMP_ID_2 :
            return _CM2CON_ON_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_OUTPUT_ENABLE_CONTROL_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_COE_MASK;
        case CMP_ID_2 :
            return _CM2CON_COE_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_INVERT_OUTPUT_CONTROL_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_CPOL_MASK;
        case CMP_ID_2 :
            return _CM2CON_CPOL_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_OUTPUT_LEVEL_CONTROL_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_COUT_MASK;
        case CMP_ID_2 :
            return _CM2CON_COUT_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_INTERRUPT_EVENT_SELECT_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_EVPOL_MASK;
        case CMP_ID_2 :
            return _CM2CON_EVPOL_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_NON_INVERTING_INPUT_SELECTION_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_CREF_MASK;
        case CMP_ID_2 :
            return _CM2CON_CREF_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_INVERTING_INPUT_SELECTION_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_CCH_MASK;
        case CMP_ID_2 :
            return _CM2CON_CCH_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_OUTPUT_STATUS_GET1_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CMSTAT_C1OUT_MASK;
        case CMP_ID_2 :
            return _CMSTAT_C2OUT_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_OUTPUT_STATUS_GET2_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CMSTAT_C1OUT_MASK;
        case CMP_ID_2 :
            return _CMSTAT_C2OUT_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_STOP_IN_IDLE_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CMSTAT_SIDL_MASK;
        case CMP_ID_2 :
            return _CMSTAT_SIDL_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_ENABLE_CONTROL_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_ON_MASK;
        case CMP_ID_2 :
            return _CVRCON_ON_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_OUTPUT_ENABLE_CONTROL_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_CVROE_MASK;
        case CMP_ID_2 :
            return _CVRCON_CVROE_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_WIDE_RANGE_CONTROL_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_CVRR_MASK;
        case CMP_ID_2 :
            return _CVRCON_CVRR_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_VOLTAGE_RANGE_SELECT_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_CVRSS_MASK;
        case CMP_ID_2 :
            return _CVRCON_CVRSS_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

