MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/cmp/processor/cmp_p32mx695f512h.h
PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_VALUE_SELECT_MASK(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_CVR_MASK;
        case CMP_ID_2 :
            return _CVRCON_CVR_MASK;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_ENABLE_CONTROL_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_ON_POSITION;
        case CMP_ID_2 :
            return _CM2CON_ON_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_OUTPUT_ENABLE_CONTROL_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_COE_POSITION;
        case CMP_ID_2 :
            return _CM2CON_COE_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_INVERT_OUTPUT_CONTROL_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_CPOL_POSITION;
        case CMP_ID_2 :
            return _CM2CON_CPOL_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_OUTPUT_LEVEL_CONTROL_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_COUT_POSITION;
        case CMP_ID_2 :
            return _CM2CON_COUT_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_INTERRUPT_EVENT_SELECT_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_EVPOL_POSITION;
        case CMP_ID_2 :
            return _CM2CON_EVPOL_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_NON_INVERTING_INPUT_SELECTION_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_CREF_POSITION;
        case CMP_ID_2 :
            return _CM2CON_CREF_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_INVERTING_INPUT_SELECTION_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_CCH_POSITION;
        case CMP_ID_2 :
            return _CM2CON_CCH_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_OUTPUT_STATUS_GET1_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CMSTAT_C1OUT_POSITION;
        case CMP_ID_2 :
            return _CMSTAT_C2OUT_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_OUTPUT_STATUS_GET2_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CMSTAT_C1OUT_POSITION;
        case CMP_ID_2 :
            return _CMSTAT_C2OUT_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_STOP_IN_IDLE_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CMSTAT_SIDL_POSITION;
        case CMP_ID_2 :
            return _CMSTAT_SIDL_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_ENABLE_CONTROL_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_ON_POSITION;
        case CMP_ID_2 :
            return _CVRCON_ON_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_OUTPUT_ENABLE_CONTROL_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_CVROE_POSITION;
        case CMP_ID_2 :
            return _CVRCON_CVROE_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_WIDE_RANGE_CONTROL_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_CVRR_POSITION;
        case CMP_ID_2 :
            return _CVRCON_CVRR_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_VOLTAGE_RANGE_SELECT_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_CVRSS_POSITION;
        case CMP_ID_2 :
            return _CVRCON_CVRSS_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_VALUE_SELECT_POS(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_CVR_POSITION;
        case CMP_ID_2 :
            return _CVRCON_CVR_POSITION;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_ENABLE_CONTROL_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_ON_LENGTH;
        case CMP_ID_2 :
            return _CM2CON_ON_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_OUTPUT_ENABLE_CONTROL_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_COE_LENGTH;
        case CMP_ID_2 :
            return _CM2CON_COE_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_INVERT_OUTPUT_CONTROL_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_CPOL_LENGTH;
        case CMP_ID_2 :
            return _CM2CON_CPOL_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_OUTPUT_LEVEL_CONTROL_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_COUT_LENGTH;
        case CMP_ID_2 :
            return _CM2CON_COUT_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_INTERRUPT_EVENT_SELECT_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_EVPOL_LENGTH;
        case CMP_ID_2 :
            return _CM2CON_EVPOL_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_NON_INVERTING_INPUT_SELECTION_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_CREF_LENGTH;
        case CMP_ID_2 :
            return _CM2CON_CREF_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_INVERTING_INPUT_SELECTION_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CM1CON_CCH_LENGTH;
        case CMP_ID_2 :
            return _CM2CON_CCH_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

