MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/cmp/processor/cmp_p32mx695f512h.h
PLIB_INLINE SFR_DATA _CMP_CMP_OUTPUT_STATUS_GET1_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CMSTAT_C1OUT_LENGTH;
        case CMP_ID_2 :
            return _CMSTAT_C2OUT_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_OUTPUT_STATUS_GET2_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CMSTAT_C1OUT_LENGTH;
        case CMP_ID_2 :
            return _CMSTAT_C2OUT_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_STOP_IN_IDLE_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CMSTAT_SIDL_LENGTH;
        case CMP_ID_2 :
            return _CMSTAT_SIDL_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_ENABLE_CONTROL_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_ON_LENGTH;
        case CMP_ID_2 :
            return _CVRCON_ON_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_OUTPUT_ENABLE_CONTROL_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_CVROE_LENGTH;
        case CMP_ID_2 :
            return _CVRCON_CVROE_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_WIDE_RANGE_CONTROL_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_CVRR_LENGTH;
        case CMP_ID_2 :
            return _CVRCON_CVRR_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_VOLTAGE_RANGE_SELECT_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_CVRSS_LENGTH;
        case CMP_ID_2 :
            return _CVRCON_CVRSS_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _CMP_CMP_CVREF_VALUE_SELECT_LEN(CMP_MODULE_ID i)
{
    switch (i) {
        case CMP_ID_1 :
            return _CVRCON_CVR_LENGTH;
        case CMP_ID_2 :
            return _CVRCON_CVR_LENGTH;
        case CMP_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/cmp_ComparatorEnableControl_Default.h"
#include "../templates/cmp_ComparatorOutputEnableControl_Default.h"
#include "../templates/cmp_InvertOutputSelectControl_Default.h"
#include "../templates/cmp_OutputLevelSelectControl_Default.h"
#include "../templates/cmp_OutputStatusGet_Default.h"
#include "../templates/cmp_InterruptEventSelect_Default.h"
#include "../templates/cmp_NonInvertingInputSelect_Default.h"
#include "../templates/cmp_InvertingInputSelect_Default.h"
#include "../templates/cmp_StopInIdle_Default.h"
#include "../templates/cmp_CVREFEnableControl_Default.h"
#include "../templates/cmp_CVREFOutputEnableControl_Default.h"
#include "../templates/cmp_CVREFWideRangeControl_Default.h"
#include "../templates/cmp_CVREFVoltageRangeSelect_Default.h"
#include "../templates/cmp_CVREFRefVoltageRangeSelect_Unsupported.h"
#include "../templates/cmp_CVREFBGRefVoltageRangeSelect_Unsupported.h"
#include "../templates/cmp_CVREFValueSelect_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API bool PLIB_CMP_ExistsEnableControl(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsEnableControl_Default(index);
         case CMP_ID_2 :
            return CMP_ExistsEnableControl_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_CMP_Enable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_Enable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_Enable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_CMP_Disable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_Disable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_Disable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsOutputEnableControl(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsOutputEnableControl_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsOutputEnableControl_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_CMP_OutputEnable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_OutputEnable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_OutputEnable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_CMP_OutputDisable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_OutputDisable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_OutputDisable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsInvertOutputControl(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsInvertOutputControl_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsInvertOutputControl_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

