MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/cmp/processor/cmp_p32mx695f512h.h
PLIB_INLINE_API void PLIB_CMP_OutputInvertEnable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_OutputInvertEnable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_OutputInvertEnable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_CMP_OutputInvertDisable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_OutputInvertDisable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_OutputInvertDisable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsOutputLevelControl(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsOutputLevelControl_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsOutputLevelControl_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_CMP_OutputLogicHigh(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_OutputLogicHigh_Default(index);
            break;
        case CMP_ID_2 :
            CMP_OutputLogicHigh_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_CMP_OutputLogicLow(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_OutputLogicLow_Default(index);
            break;
        case CMP_ID_2 :
            CMP_OutputLogicLow_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsOutputStatusGet(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsOutputStatusGet_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsOutputStatusGet_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_CMP_OutputStatusGet(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_OutputStatusGet_Default(index);
        case CMP_ID_2 :
            return CMP_OutputStatusGet_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsInterruptEventSelect(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsInterruptEventSelect_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsInterruptEventSelect_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_CMP_InterruptEventSelect(CMP_MODULE_ID index, CMP_INTERRUPT_EVENT event)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_InterruptEventSelect_Default(index, event);
            break;
        case CMP_ID_2 :
            CMP_InterruptEventSelect_Default(index, event);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsNonInvertingInputSelect(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsNonInvertingInputSelect_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsNonInvertingInputSelect_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_CMP_NonInvertingInputChannelSelect(CMP_MODULE_ID index, CMP_NON_INVERTING_INPUT input)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_NonInvertingInputChannelSelect_Default(index, input);
            break;
        case CMP_ID_2 :
            CMP_NonInvertingInputChannelSelect_Default(index, input);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsInvertingInputSelect(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsInvertingInputSelect_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsInvertingInputSelect_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_CMP_InvertingInputChannelSelect(CMP_MODULE_ID index, CMP_INVERTING_INPUT channel)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_InvertingInputChannelSelect_Default(index, channel);
            break;
        case CMP_ID_2 :
            CMP_InvertingInputChannelSelect_Default(index, channel);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsStopInIdle(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsStopInIdle_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsStopInIdle_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_CMP_StopInIdleModeEnable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_StopInIdleModeEnable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_StopInIdleModeEnable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_CMP_StopInIdleModeDisable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_StopInIdleModeDisable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_StopInIdleModeDisable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsCVREFEnableControl(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsCVREFEnableControl_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsCVREFEnableControl_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_CMP_CVREF_Enable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_CVREF_Enable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_CVREF_Enable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

