MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/cmp/processor/cmp_p32mx695f512h.h
PLIB_INLINE_API void PLIB_CMP_CVREF_Disable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_CVREF_Disable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_CVREF_Disable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsCVREFOutputEnableControl(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsCVREFOutputEnableControl_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsCVREFOutputEnableControl_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_CMP_CVREF_OutputEnable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_CVREF_OutputEnable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_CVREF_OutputEnable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_CMP_CVREF_OutputDisable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_CVREF_OutputDisable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_CVREF_OutputDisable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsCVREFWideRangeControl(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsCVREFWideRangeControl_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsCVREFWideRangeControl_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_CMP_CVREF_WideRangeEnable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_CVREF_WideRangeEnable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_CVREF_WideRangeEnable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_CMP_CVREF_WideRangeDisable(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_CVREF_WideRangeDisable_Default(index);
            break;
        case CMP_ID_2 :
            CMP_CVREF_WideRangeDisable_Default(index);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_CVREF_WideRangeIsEnabled(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_CVREF_WideRangeIsEnabled_Default(index);
        case CMP_ID_2 :
            return CMP_CVREF_WideRangeIsEnabled_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsCVREFVoltageRangeSelect(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsCVREFVoltageRangeSelect_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsCVREFVoltageRangeSelect_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_CMP_CVREF_SourceVoltageSelect(CMP_MODULE_ID index, CMP_CVREF_VOLTAGE_SOURCE source)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_CVREF_SourceVoltageSelect_Default(index, source);
            break;
        case CMP_ID_2 :
            CMP_CVREF_SourceVoltageSelect_Default(index, source);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsCVREFRefVoltageRangeSelect(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsCVREFRefVoltageRangeSelect_Unsupported(index);
        case CMP_ID_2 :
            return CMP_ExistsCVREFRefVoltageRangeSelect_Unsupported(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_CMP_CVREF_ReferenceVoltageSelect(CMP_MODULE_ID index, CMP_CVREF_REFERENCE_SELECT reference)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_CVREF_ReferenceVoltageSelect_Unsupported(index, reference);
            break;
        case CMP_ID_2 :
            CMP_CVREF_ReferenceVoltageSelect_Unsupported(index, reference);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsCVREFBGRefVoltageRangeSelect(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsCVREFBGRefVoltageRangeSelect_Unsupported(index);
        case CMP_ID_2 :
            return CMP_ExistsCVREFBGRefVoltageRangeSelect_Unsupported(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_CMP_CVREF_BandGapReferenceSourceSelect(CMP_MODULE_ID index, CMP_CVREF_BANDGAP_SELECT select)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_CVREF_BandGapReferenceSourceSelect_Unsupported(index, select);
            break;
        case CMP_ID_2 :
            CMP_CVREF_BandGapReferenceSourceSelect_Unsupported(index, select);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_CMP_ExistsCVREFValueSelect(CMP_MODULE_ID index)
{
    switch (index) {
        case CMP_ID_1 :
            return CMP_ExistsCVREFValueSelect_Default(index);
        case CMP_ID_2 :
            return CMP_ExistsCVREFValueSelect_Default(index);
        case CMP_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_CMP_CVREF_ValueSelect(CMP_MODULE_ID index, CMP_CVREF_VALUE value)
{
    switch (index) {
        case CMP_ID_1 :
            CMP_CVREF_ValueSelect_Default(index, value);
            break;
        case CMP_ID_2 :
            CMP_CVREF_ValueSelect_Default(index, value);
            break;
        case CMP_NUMBER_OF_MODULES :
        default :
            break;
    }
}

#endif
